TAL_INT_GIT/Sample Data/BY_WMS/INV_STS_CHG/INV_STS_CHG_SOAP_Req2/INV_STS_CHG_SOAP_Req

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:soap:functions:mc-style">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZwmInventoryStatChange>
         <ItInvStat>
            <!--Zero or more repetitions:-->
            <item>
               <Prtnum>?</Prtnum>
               <PrtClientId>?</PrtClientId>
               <Revlvl>?</Revlvl>
               <Lotnum>?</Lotnum>
               <Chgqty>?</Chgqty>
               <FrInvsts>?</FrInvsts>
               <ToInvsts>?</ToInvsts>
               <Reacod>?</Reacod>
               <WhId>?</WhId>
            </item>
			 <item>
               <Prtnum>?</Prtnum>
               <PrtClientId>?</PrtClientId>
               <Revlvl>?</Revlvl>
               <Lotnum>?</Lotnum>
               <Chgqty>?</Chgqty>
               <FrInvsts>?</FrInvsts>
               <ToInvsts>?</ToInvsts>
               <Reacod>?</Reacod>
               <WhId>?</WhId>
            </item>
         </ItInvStat>
         <ItMatDoc>
            <!--Zero or more repetitions:-->
            <item>
               <Mblnr>?</Mblnr>
               <Mjahr>?</Mjahr>
            </item>
			<item>
               <Mblnr>?</Mblnr>
               <Mjahr>?</Mjahr>
            </item>
         </ItMatDoc>
         <Return>
            <!--Zero or more repetitions:-->
            <item>
               <Type>?</Type>
               <Id>?</Id>
               <Number>?</Number>
               <Message>?</Message>
               <LogNo>?</LogNo>
               <LogMsgNo>?</LogMsgNo>
               <MessageV1>?</MessageV1>
               <MessageV2>?</MessageV2>
               <MessageV3>?</MessageV3>
               <MessageV4>?</MessageV4>
               <Parameter>?</Parameter>
               <Row>?</Row>
               <Field>?</Field>
               <System>?</System>
            </item>
			<item>
               <Type>?</Type>
               <Id>?</Id>
               <Number>?</Number>
               <Message>?</Message>
               <LogNo>?</LogNo>
               <LogMsgNo>?</LogMsgNo>
               <MessageV1>?</MessageV1>
               <MessageV2>?</MessageV2>
               <MessageV3>?</MessageV3>
               <MessageV4>?</MessageV4>
               <Parameter>?</Parameter>
               <Row>?</Row>
               <Field>?</Field>
               <System>?</System>
            </item>
         </Return>
      </urn:ZwmInventoryStatChange>
   </soapenv:Body>
</soapenv:Envelope>